<a href="https://colab.research.google.com/github/bhagye/phyton-new/blob/module-3/Untitled_Copy1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

df = pd.read_csv('C:\\Users\HP\Desktop\menu.csv')

print(df.to_string())

   s.no  lunch(veg)   lunch(non veg) tiffins dinner
0     1  fried rice  chicken biryani    dosa  rasam
1     2     biryani       fish curry    idly   curd
2     3    icecream         icecream   poori    dal

In [ ]:
import pandas as pd

df = pd.read_csv('C:\\Users\HP\Desktop\Marks.csv')

print(df.to_string())

    s.no      name  marks
0      1  bhagyesh     94
1      2   aravind     98
2      3    harsha     96
3      4     subbu     98

In [ ]:
import pandas
mydataset = {'session': ["morning", "afternoon", "night"],'number of kgs': [25,30,45]}
myvar = pandas.DataFrame(mydataset)
print(myvar)

     session  number of kgs
0    morning             25
1  afternoon             30
2      night             45

In [ ]:
import pandas as pd
print(pd.__version__)

1.3.4

In [ ]:
import pandas as pd
a = [2,85.45]
b = pd.Series(a)
print(b)

0     2.00
1    85.45
dtype: float64

In [ ]:
import pandas as pd
a = ['chaitu','aravind','bhagyesh']
b = pd.Series(a, index = ['1','2','3'])
print(b)

1      chaitu
2     aravind
3    bhagyesh
dtype: object

In [ ]:
import pandas as pd
a = pd.read_csv('D:\\names.csv')
b = pd.DataFrame(a)
print(b)

    s.no     Name   Age      mobile         mail mail.1  mail.2  Unnamed: 7  \
0      1  bhagyesh   18  9874581585  **@gitam.in    NaN   *****         NaN
1      2    chaitu   18  7780442077  **@gitam.in    .in   *****         NaN
2      3   aravind   17  7780442088  **@gitam.in    NaN  ******         NaN
3      4   harsha    17  7780442011  **@gitam.in    NaN   *****         NaN
4      5   karthik   17  9875638271  **@gitam.in    NaN   *****         NaN
5      6     subbu   18  8294629163  **@gitam.in    NaN   *****         NaN
6      7    nithin   19  2738263826  **@gitam.in    NaN   *****         NaN
7      8      jogi   22  6382936237  **@gitam.in    NaN    ****         NaN
8      9      banu   20  3563726372  **@gitam.in    NaN  ******         NaN
9     10      puli   20  8982773628  **@gitam.in    NaN   *****         NaN
10    11   dhanush   18  9989348838  **@gitam.in    NaN    ****         NaN
11    12  prabhas    18  7981769148  **@gitam.in    NaN   *****         NaN
12    13     pavan   18  8341287189  **@gitam.in    NaN  ******         NaN
13    14   pranav    19  9989368264  **@gitam.in    NaN   *****         NaN
14    15     kiran   18  4729346292  **@gitam.in    NaN  ******         NaN
15    16     tarun   18  9273461836  **@gitam.in    NaN   *****         NaN
16    17     varun   18  8193728361  **@gitam.in    NaN   *****         NaN
17    18    sativk   18  9361836173  **@gitam.in    NaN    ****         NaN
18    19   jayanth   19  9374683654  **@gitam.in    NaN    ****         NaN
19    20   sandeep   19  9163518458  **@gitam.in    NaN   *****         NaN
20    21      sai    18  8631458537  **@gitam.in    NaN   *****         NaN
21    22    charan   18  9784143538  **@gitam.in    NaN    ****         NaN
22    23    mukesh   18  9135926954  **@gitam.in    NaN   *****         NaN
23    24    vikey    18  9156359126  **@gitam.in    NaN   *****         NaN
24    25      para   18  9641586458  **@gitam.in    NaN   *****         NaN
25    26   doremon   18  9162549145  **@gitam.in    NaN  ******         NaN
26    27     phani   18  9135693591  **@gitam.in    NaN   *****         NaN
27    28    partiv   18  9126551955  **@gitam.in    NaN   *****         NaN
28    29     hari    19  1958194192  **@gitam.in    NaN   *****         NaN
29    30     surya   19  9495419516  **@gitam.in    NaN   *****         NaN

    Unnamed: 8  Unnamed: 9  Unnamed: 10  Unnamed: 11  Unnamed: 12 Unnamed: 13
0          NaN         NaN          NaN          NaN          NaN         NaN
1          NaN         NaN          NaN          NaN          NaN         NaN
2          NaN         NaN          NaN          NaN          NaN         NaN
3          NaN         NaN          NaN          NaN          NaN         NaN
4          NaN         NaN          NaN          NaN          NaN         NaN
5          NaN         NaN          NaN          NaN          NaN         NaN
6          NaN         NaN          NaN          NaN          NaN
7          NaN         NaN          NaN          NaN          NaN         NaN
8          NaN         NaN          NaN          NaN          NaN         NaN
9          NaN         NaN          NaN          NaN          NaN         NaN
10         NaN         NaN          NaN          NaN          NaN         NaN
11         NaN         NaN          NaN          NaN          NaN         NaN
12         NaN         NaN          NaN          NaN          NaN         NaN
13         NaN         NaN          NaN          NaN          NaN         NaN
14         NaN         NaN          NaN          NaN          NaN         NaN
15         NaN         NaN          NaN          NaN          NaN         NaN
16         NaN         NaN          NaN          NaN          NaN         NaN
17         NaN         NaN          NaN          NaN          NaN         NaN
18         NaN         NaN          NaN          NaN          NaN         NaN
19         NaN         NaN          NaN          NaN          NaN         NaN
20         NaN         NaN          NaN          NaN          NaN         NaN
21         NaN         NaN          NaN          NaN          NaN         NaN
22         NaN         NaN          NaN          NaN          NaN         NaN
23         NaN         NaN          NaN          NaN          NaN         NaN
24         NaN         NaN          NaN          NaN          NaN         NaN
25         NaN         NaN          NaN          NaN          NaN         NaN
26         NaN         NaN          NaN          NaN          NaN         NaN
27         NaN         NaN          NaN          NaN          NaN         NaN
28         NaN         NaN          NaN          NaN          NaN         NaN
29         NaN         NaN          NaN          NaN          NaN         NaN

In [ ]:
import pandas as pd
df=pd.read_csv('D:\\names.csv')
a[:10]
a.aggregate({'Age':['min','max']})

     Age
min   17
max   22

In [ ]:
import pandas as pd 
a=pd.read_csv('D:\\names.csv')
a[:10]

,s.no,Name,Age,mobile,mail,mail.1,mail.2,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,1,bhagyesh,18,9874581585,**@gitam.in,NaN,*****,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,chaitu,18,7780442077,**@gitam.in,.in,*****,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,aravind,17,7780442088,**@gitam.in,NaN,******,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,harsha,17,7780442011,**@gitam.in,NaN,*****,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,karthik,17,9875638271,**@gitam.in,NaN,*****,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,6,subbu,18,8294629163,**@gitam.in,NaN,*****,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,7,nithin,19,2738263826,**@gitam.in,NaN,*****,NaN,NaN,NaN,NaN,NaN,NaN,
7,8,jogi,22,6382936237,**@gitam.in,NaN,****,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,9,banu,20,3563726372,**@gitam.in,NaN,******,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,10,puli,20,8982773628,**@gitam.in,NaN,*****,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [ ]:
import pandas as pd
a=pd.read_csv('D:\\names.csv')
a[:10]
a.aggregate({'mobile':['min','max']})

         mobile
min  1958194192
max  9989368264

In [ ]:
import pandas as pd
a=pd.read_csv('D:\\names.csv')
a[:10]
a.aggregate({'mail':['min','max']})

            mail
min  **@gitam.in
max  **@gitam.in

In [ ]:
import pandas as vk
a = df.groupby(['mobile','Age'])
print(type(a))
print(pd.DataFrame(a))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
                   0                                                  1
0   (1958194192, 19)      s.no  Name   Age      mobile         mail ...
1   (2738263826, 19)     s.no   Name   Age      mobile         mail ...
2   (3563726372, 20)     s.no Name   Age      mobile         mail ma...
3   (4729346292, 18)      s.no  Name   Age      mobile         mail ...
4   (6382936237, 22)     s.no Name   Age      mobile         mail ma...
5   (7780442011, 17)     s.no    Name   Age      mobile         mail...
6   (7780442077, 18)     s.no   Name   Age      mobile         mail ...
7   (7780442088, 17)     s.no    Name   Age      mobile         mail...
8   (7981769148, 18)      s.no     Name   Age      mobile         ma...
9   (8193728361, 18)      s.no  Name   Age      mobile         mail ...
10  (8294629163, 18)     s.no  Name   Age      mobile         mail m...
11  (8341287189, 18)      s.no  Name   Age      mobile         mail ...
12  (8631458537, 18)      s.no Name   Age      mobile         mail m...
13  (8982773628, 20)     s.no Name   Age      mobile         mail ma...
14  (9126551955, 18)      s.no   Name   Age      mobile         mail...
15  (9135693591, 18)      s.no  Name   Age      mobile         mail ...
16  (9135926954, 18)      s.no   Name   Age      mobile         mail...
17  (9156359126, 18)      s.no   Name   Age      mobile         mail...
18  (9162549145, 18)      s.no    Name   Age      mobile         mai...
19  (9163518458, 19)      s.no    Name   Age      mobile         mai...
20  (9273461836, 18)      s.no  Name   Age      mobile         mail ...
21  (9361836173, 18)      s.no   Name   Age      mobile         mail...
22  (9374683654, 19)      s.no    Name   Age      mobile         mai...
23  (9495419516, 19)      s.no  Name   Age      mobile         mail ...
24  (9641586458, 18)      s.no Name   Age      mobile         mail m...
25  (9784143538, 18)      s.no   Name   Age      mobile         mail...
26  (9874581585, 18)     s.no     Name   Age      mobile         mai...
27  (9875638271, 17)     s.no    Name   Age      mobile         mail...
28  (9989348838, 18)      s.no    Name   Age      mobile         mai...
29  (9989368264, 19)      s.no    Name   Age      mobile         mai...